<a href="https://colab.research.google.com/github/RoozbehSanaei/SQL/blob/main/SQL_Basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!git clone https://github.com/RoozbehSanaei/SQL.git

Cloning into 'SQL'...
remote: Enumerating objects: 6, done.
remote: Counting objects: 100% (6/6), done.
remote: Compressing objects: 100% (4/4), done.
remote: Total 6 (delta 0), reused 6 (delta 0), pack-reused 0
Unpacking objects: 100% (6/6), done.

In [ ]:
import pandas as pd
import sqlite3

In [ ]:
Customers = pd.read_excel(
    'SQL/Customers.xlsx', 
    sheet_name='Customers',
    header=0)


Categories = pd.read_excel(
    'SQL/Customers.xlsx', 
    sheet_name='Categories',
    header=0)


Employees = pd.read_excel(
    'SQL/Customers.xlsx', 
    sheet_name='Employees',
    header=0)


OrderDetails = pd.read_excel(
    'SQL/Customers.xlsx', 
    sheet_name='OrderDetails',
    header=0)


Orders = pd.read_excel(
    'SQL/Customers.xlsx', 
    sheet_name='Orders',
    header=0)


Product = pd.read_excel(
    'SQL/Customers.xlsx', 
    sheet_name='Product',
    header=0)


Shippers = pd.read_excel(
    'SQL/Customers.xlsx', 
    sheet_name='Shippers',
    header=0)

In [ ]:
db_conn = sqlite3.connect("customers.db")
c = db_conn.cursor()

In [ ]:
c.execute(
    """
    CREATE TABLE Customers (
        CustomerID INTEGER ,
        CustomerName TEXT NOT NULL,
        ContactName TEXT NOT NULL,
        Address TEXT NOT NULL,
        City TEXT NOT NULL,
        PostalCode INTEGER,
        Country TEXT NOT NULL,
        PRIMARY KEY(CustomerID)
        );
     """
)

c.execute(
    """
    CREATE TABLE Orders (
        OrderID INTEGER ,
        CustomerID INTEGER ,
        EmployeeID INTEGER ,
        OrderDate DATE,
        ShipperID INTEGER,
        PRIMARY KEY(OrderID),
        FOREIGN KEY(CustomerID) REFERENCES customers(CustomerID)
        );
     """
)

OperationalError: ignored

In [ ]:
Customers.to_sql('Customers', db_conn, if_exists='append', index=False)
Orders.to_sql('Orders', db_conn, if_exists='append', index=False)

In [ ]:
pd.read_sql("SELECT * FROM Orders LIMIT 5", db_conn)

   OrderID  CustomerID  EmployeeID            OrderDate  ShipperID
0    10248          90           5  1996-07-04 00:00:00          3
1    10249          81           6  1996-07-05 00:00:00          1
2    10250          34           4  1996-07-08 00:00:00          2
3    10251          84           3  1996-07-08 00:00:00          1
4    10252          76           4  1996-07-09 00:00:00          2

In [ ]:
c.execute("""DROP TABLE IF EXISTS Customers""")

In [ ]:
db_conn.close()

In [ ]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
%sql sqlite:///customers.db

'Connected: @customers.db'

In [ ]:
 %%sql 
SELECT * FROM Orders LIMIT 5

 * sqlite:///customers.db
Done.

[(10248, 90, 5, '1996-07-04 00:00:00', 3),
 (10249, 81, 6, '1996-07-05 00:00:00', 1),
 (10250, 34, 4, '1996-07-08 00:00:00', 2),
 (10251, 84, 3, '1996-07-08 00:00:00', 1),
 (10252, 76, 4, '1996-07-09 00:00:00', 2)]

In [ ]:
%%sql
SELECT CustomerName,City FROM Customers LIMIT 5;

 * sqlite:///customers.db
Done.

[('Alfreds Futterkiste', 'Berlin'),
 ('Ana Trujillo Emparedados y helados', 'México D.F.'),
 ('Antonio Moreno Taquería', 'México D.F.'),
 ('Around the Horn', 'London'),
 ('Berglunds snabbköp', 'Luleå')]

In [ ]:
%%sql
SELECT * FROM Customers WHERE Country='Mexico';

 * sqlite:///customers.db
Done.

[(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', 5021, 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', 5023, 'Mexico'),
 (13, 'Centro comercial Moctezuma', 'Francisco Chang', 'Sierras de Granada 9993', 'México D.F.', 5022, 'Mexico'),
 (58, 'Pericles Comidas clásicas', 'Guillermo Fernández', 'Calle Dr. Jorge Cash 321', 'México D.F.', 5033, 'Mexico'),
 (80, 'Tortuga Restaurante', 'Miguel Angel Paolino', 'Avda. Azteca 123', 'México D.F.', 5033, 'Mexico')]

In [ ]:
%%sql
SELECT * FROM Customers WHERE Country='Mexico';

In [ ]:
%%sql
SELECT * FROM Customers
WHERE Country='Germany' AND City='Berlin';

 * sqlite:///customers.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', 12209, 'Germany')]

In [ ]:
%%sql
SELECT * FROM Customers WHERE City='Berlin' OR City='München';

 * sqlite:///customers.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', 12209, 'Germany'),
 (25, 'Frankenversand', 'Peter Franken', 'Berliner Platz 43', 'München', 80805, 'Germany')]

In [ ]:
%%sql
SELECT * FROM Customers WHERE NOT Country='Germany' LIMIT 5;

 * sqlite:///customers.db
Done.

[(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', 5021, 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', 5023, 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden'),
 (7, 'Blondel père et fils', 'Frédérique Citeaux', '24, place Kléber', 'Strasbourg', 67000, 'France')]

In [ ]:
%%sql
SELECT * FROM Customers WHERE Country='Germany' AND (City='Berlin' OR City='München');

 * sqlite:///customers.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', 12209, 'Germany'),
 (25, 'Frankenversand', 'Peter Franken', 'Berliner Platz 43', 'München', 80805, 'Germany')]

In [ ]:
%%sql
SELECT * FROM Customers WHERE NOT Country='Germany' AND NOT Country='USA' LIMIT 5;

 * sqlite:///customers.db
Done.

[(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', 5021, 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', 5023, 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden'),
 (7, 'Blondel père et fils', 'Frédérique Citeaux', '24, place Kléber', 'Strasbourg', 67000, 'France')]

In [ ]:
%%sql
SELECT * FROM Customers ORDER BY Country LIMIT 5;

 * sqlite:///customers.db
Done.

[(12, 'Cactus Comidas para llevar', 'Patricio Simpson', 'Cerrito 333', 'Buenos Aires', 1010, 'Argentina'),
 (54, 'Océano Atlántico Ltda.', 'Yvonne Moncada', 'Ing. Gustavo Moncada 8585 Piso 20-A', 'Buenos Aires', 1010, 'Argentina'),
 (64, 'Rancho grande', 'Sergio Gutiérrez', 'Av. del Libertador 900', 'Buenos Aires', 1010, 'Argentina'),
 (20, 'Ernst Handel', 'Roland Mendel', 'Kirchgasse 6', 'Graz', 8010, 'Austria'),
 (59, 'Piccolo und mehr', 'Georg Pipps', 'Geislweg 14', 'Salzburg', 5020, 'Austria')]

In [ ]:
%%sql
SELECT * FROM Customers ORDER BY Country DESC LIMIT 5;

 * sqlite:///customers.db
Done.

[(33, 'GROSELLA-Restaurante', 'Manuel Pereira', '5ª Ave. Los Palos Grandes', 'Caracas', 1081, 'Venezuela'),
 (35, 'HILARIÓN-Abastos', 'Carlos Hernández', 'Carrera 22 con Ave. Carlos Soublette #8-35', 'San Cristóbal', 5022, 'Venezuela'),
 (46, 'LILA-Supermercado', 'Carlos González', 'Carrera 52 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', 3508, 'Venezuela'),
 (47, 'LINO-Delicateses', 'Felipe Izquierdo', 'Ave. 5 de Mayo Porlamar', 'I. de Margarita', 4980, 'Venezuela'),
 (32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', 97403, 'USA')]

In [ ]:
%%sql
SELECT * FROM Customers ORDER BY Country, CustomerName LIMIT 5;

 * sqlite:///customers.db
Done.

[(12, 'Cactus Comidas para llevar', 'Patricio Simpson', 'Cerrito 333', 'Buenos Aires', 1010, 'Argentina'),
 (54, 'Océano Atlántico Ltda.', 'Yvonne Moncada', 'Ing. Gustavo Moncada 8585 Piso 20-A', 'Buenos Aires', 1010, 'Argentina'),
 (64, 'Rancho grande', 'Sergio Gutiérrez', 'Av. del Libertador 900', 'Buenos Aires', 1010, 'Argentina'),
 (20, 'Ernst Handel', 'Roland Mendel', 'Kirchgasse 6', 'Graz', 8010, 'Austria'),
 (59, 'Piccolo und mehr', 'Georg Pipps', 'Geislweg 14', 'Salzburg', 5020, 'Austria')]

In [ ]:
%%sql
SELECT * FROM Customers ORDER BY Country ASC, CustomerName DESC LIMIT 5;

 * sqlite:///customers.db
Done.

[(64, 'Rancho grande', 'Sergio Gutiérrez', 'Av. del Libertador 900', 'Buenos Aires', 1010, 'Argentina'),
 (54, 'Océano Atlántico Ltda.', 'Yvonne Moncada', 'Ing. Gustavo Moncada 8585 Piso 20-A', 'Buenos Aires', 1010, 'Argentina'),
 (12, 'Cactus Comidas para llevar', 'Patricio Simpson', 'Cerrito 333', 'Buenos Aires', 1010, 'Argentina'),
 (59, 'Piccolo und mehr', 'Georg Pipps', 'Geislweg 14', 'Salzburg', 5020, 'Austria'),
 (20, 'Ernst Handel', 'Roland Mendel', 'Kirchgasse 6', 'Graz', 8010, 'Austria')]

In [ ]:
%%sql
INSERT INTO Customers (CustomerName, ContactName, Address, City, PostalCode, Country)
VALUES ('Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway');

 * sqlite:///customers.db
1 rows affected.

[]

In [ ]:
%%sql
UPDATE Customers SET ContactName = 'Alfred Schmidt', City= 'Frankfurt' WHERE CustomerID = 1;

 * sqlite:///customers.db
1 rows affected.

[]

In [ ]:
%%sql
DELETE FROM Customers WHERE CustomerName='Alfreds Futterkiste';

 * sqlite:///customers.db
1 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM Customers FETCH 3 ROWS ONLY;

 * sqlite:///customers.db
(sqlite3.OperationalError) near "3": syntax error
[SQL: SELECT * FROM Customers FETCH 3 ROWS ONLY;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [ ]:
%%sql
CREATE TABLE Products (
    ProductID INTEGER,
    ProductName TEXT NOT NULL,
    SupplierID INTEGER,
    CategoryID INTEGER,
    Unit TEXT NOT NULL,
    Price REAL
);

 * sqlite:///customers.db
Done.

[]

In [ ]:
db_conn = sqlite3.connect("customers.db")
Product.to_sql('Products', db_conn, if_exists='append', index=False)

In [ ]:
%%sql
SELECT MIN(Price) AS SmallestPrice FROM Products;

 * sqlite:///customers.db
Done.
Done.

[(263.5,)]

In [ ]:
%%sql
SELECT MAX(Price) AS LargestPrice FROM Products;

 * sqlite:///customers.db
Done.

[(263.5,)]

In [ ]:
%%sql
SELECT COUNT(ProductID) FROM Products;

 * sqlite:///customers.db
Done.

[(77,)]

In [ ]:
%%sql
SELECT AVG(ProductID) FROM Products;

 * sqlite:///customers.db
Done.

[(39.0,)]

In [ ]:
%%sql
SELECT SUM(Quantity) FROM OrderDetails;

 * sqlite:///customers.db
Done.

[(12743,)]

In [ ]:
%%sql
CREATE TABLE OrderDetails (
    OrderDetailID INTEGER,
    OrderID INTEGER,
    ProductID INTEGER,
    Quantity INTEGER
);

 * sqlite:///customers.db
(sqlite3.OperationalError) table OrderDetails already exists
[SQL: CREATE TABLE OrderDetails (
    OrderDetailID INTEGER,
    OrderID INTEGER,
    ProductID INTEGER,
    Quantity INTEGER
);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [ ]:
OrderDetails.to_sql('OrderDetails', db_conn, if_exists='append', index=False)

In [ ]:
%%sql
SELECT SUM(Quantity) FROM OrderDetails;

 * sqlite:///customers.db
Done.

[(25486,)]

In [ ]:
%%sql
SELECT * FROM Customers WHERE CustomerName LIKE 'a%';

 * sqlite:///customers.db
Done.

[(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', 5021, 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', 5023, 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')]

In [ ]:
%%sql
SELECT * FROM Customers WHERE CustomerName LIKE '%a' LIMIT 5;

 * sqlite:///customers.db
Done.

[(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', 5023, 'Mexico'),
 (13, 'Centro comercial Moctezuma', 'Francisco Chang', 'Sierras de Granada 9993', 'México D.F.', 5022, 'Mexico'),
 (30, 'Godos Cocina Típica', 'José Pedro Freyre', 'C/ Romero, 33', 'Sevilla', 41101, 'Spain'),
 (61, 'Que Delícia', 'Bernardo Batista', 'Rua da Panificadora, 12', 'Rio de Janeiro', '02389-673', 'Brazil'),
 (62, 'Queen Cozinha', 'Lúcia Carvalho', 'Alameda dos Canàrios, 891', 'São Paulo', '05487-020', 'Brazil')]

In [ ]:
%%sql
SELECT * FROM Customers WHERE CustomerName LIKE '%or%' LIMIT 5;

 * sqlite:///customers.db
Done.

[(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', 5023, 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (36, 'Hungry Coyote Import Store', 'Yoshi Latimer', 'City Center Plaza 516 Main St.', 'Elgin', 97827, 'USA'),
 (40, "La corne d'abondance", 'Daniel Tonini', "67, avenue de l'Europe", 'Versailles', 78000, 'France'),
 (43, 'Lazy K Kountry Store', 'John Steel', '12 Orchestra Terrace', 'Walla Walla', 99362, 'USA')]

In [ ]:
%%sql
SELECT * FROM Customers WHERE CustomerName LIKE '_r%' LIMIT 5;

 * sqlite:///customers.db
Done.

[(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (17, 'Drachenblut Delikatessend', 'Sven Ottlieb', 'Walserweg 21', 'Aachen', 52066, 'Germany'),
 (20, 'Ernst Handel', 'Roland Mendel', 'Kirchgasse 6', 'Graz', 8010, 'Austria'),
 (25, 'Frankenversand', 'Peter Franken', 'Berliner Platz 43', 'München', 80805, 'Germany'),
 (26, 'France restauration', 'Carine Schmitt', '54, rue Royale', 'Nantes', 44000, 'France')]

In [ ]:
%%sql
SELECT * FROM Customers WHERE CustomerName LIKE 'a__%';

 * sqlite:///customers.db
Done.

[(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', 5021, 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', 5023, 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')]

In [ ]:
%%sql
SELECT * FROM Customers WHERE ContactName LIKE 'a%o';

 * sqlite:///customers.db
Done.

[(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', 5021, 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', 5023, 'Mexico'),
 (69, 'Romero y tomillo', 'Alejandra Camino', 'Gran Vía, 1', 'Madrid', 28001, 'Spain')]

In [ ]:
%%sql
SELECT * FROM Customers WHERE CustomerName NOT LIKE 'a%' LIMIT 5;

 * sqlite:///customers.db
Done.

[(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden'),
 (6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', 68306, 'Germany'),
 (7, 'Blondel père et fils', 'Frédérique Citeaux', '24, place Kléber', 'Strasbourg', 67000, 'France'),
 (8, 'Bólido Comidas preparadas', 'Martín Sommer', 'C/ Araquil, 67', 'Madrid', 28023, 'Spain'),
 (9, "Bon app'", 'Laurence Lebihans', '12, rue des Bouchers', 'Marseille', 13008, 'France')]

In [ ]:
%%sql
SELECT * FROM Customers WHERE City LIKE 'ber%';

 * sqlite:///customers.db
Done.

[(14, 'Chop-suey Chinese', 'Yang Wang', 'Hauptstr. 29', 'Bern', 3012, 'Switzerland'),
 (49, 'Magazzini Alimentari Riuniti', 'Giovanni Rovelli', 'Via Ludovico il Moro 22', 'Bergamo', 24100, 'Italy')]

In [ ]:
%%sql
SELECT * FROM Customers WHERE City LIKE '%es%' LIMIT 5;

 * sqlite:///customers.db
Done.

[(12, 'Cactus Comidas para llevar', 'Patricio Simpson', 'Cerrito 333', 'Buenos Aires', 1010, 'Argentina'),
 (18, 'Du monde entier', 'Janine Labrune', '67, rue des Cinquante Otages', 'Nantes', 44000, 'France'),
 (26, 'France restauration', 'Carine Schmitt', '54, rue Royale', 'Nantes', 44000, 'France'),
 (38, 'Island Trading', 'Helen Bennett', 'Garden House Crowther Way', 'Cowes', 'PO31 7PJ', 'UK'),
 (40, "La corne d'abondance", 'Daniel Tonini', "67, avenue de l'Europe", 'Versailles', 78000, 'France')]

In [ ]:
%%sql
SELECT * FROM Customers WHERE City LIKE '_ondon';

 * sqlite:///customers.db
Done.

[(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (11, "B's Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK'),
 (16, 'Consolidated Holdings', 'Elizabeth Brown', 'Berkeley Gardens 12 Brewery', 'London', 'WX1 6LT', 'UK'),
 (19, 'Eastern Connection', 'Ann Devon', '35 King George', 'London', 'WX3 6FW', 'UK'),
 (53, 'North/South', 'Simon Crowther', 'South House 300 Queensbridge', 'London', 'SW7 1RZ', 'UK'),
 (72, 'Seven Seas Imports', 'Hari Kumar', '90 Wadhurst Rd.', 'London', 'OX15 4NB', 'UK')]

In [ ]:
%%sql
SELECT * FROM Customers WHERE City LIKE 'L_n_on';

 * sqlite:///customers.db
Done.

[(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (11, "B's Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK'),
 (16, 'Consolidated Holdings', 'Elizabeth Brown', 'Berkeley Gardens 12 Brewery', 'London', 'WX1 6LT', 'UK'),
 (19, 'Eastern Connection', 'Ann Devon', '35 King George', 'London', 'WX3 6FW', 'UK'),
 (53, 'North/South', 'Simon Crowther', 'South House 300 Queensbridge', 'London', 'SW7 1RZ', 'UK'),
 (72, 'Seven Seas Imports', 'Hari Kumar', '90 Wadhurst Rd.', 'London', 'OX15 4NB', 'UK')]

In [ ]:
%%sql
SELECT * FROM Customers WHERE City LIKE '[bsp]%';

 * sqlite:///customers.db
Done.

[]

In [ ]:
%%sql
SELECT * FROM Customers WHERE Country IN ('Germany', 'France', 'UK') LIMIT 5;

 * sqlite:///customers.db
Done.

[(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', 68306, 'Germany'),
 (7, 'Blondel père et fils', 'Frédérique Citeaux', '24, place Kléber', 'Strasbourg', 67000, 'France'),
 (9, "Bon app'", 'Laurence Lebihans', '12, rue des Bouchers', 'Marseille', 13008, 'France'),
 (11, "B's Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK')]

In [ ]:
%%sql
SELECT * FROM Customers WHERE Country NOT IN ('Germany', 'France', 'UK') LIMIT 5;

 * sqlite:///customers.db
Done.

[(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', 5021, 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', 5023, 'Mexico'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden'),
 (8, 'Bólido Comidas preparadas', 'Martín Sommer', 'C/ Araquil, 67', 'Madrid', 28023, 'Spain'),
 (10, 'Bottom-Dollar Marketse', 'Elizabeth Lincoln', '23 Tsawassen Blvd.', 'Tsawassen', 'T2F 8M4', 'Canada')]

In [ ]:
%%sql
CREATE TABLE Suppliers (
    SupplierID INTEGER,
    SupplierName TEXT NOT NULL,
    ContactName TEXT NOT NULL,
    Address TEXT NOT NULL,
    City TEXT NOT NULL,
    PostalCode TEXT NOT NULL,
    Country TEXT NOT NULL,
    Phone TEXT NOT NULL,
);

In [ ]:
Suppliers = pd.read_excel('SQL/Customers.xlsx', sheet_name='Suppliers',header=0)
Product.to_sql('Suppliers', db_conn, if_exists='append', index=False)

In [ ]:
%%sql
SELECT * FROM Customers WHERE Country IN (SELECT Country FROM Suppliers) LIMIT 5;

 * sqlite:///customers.db
Done.

[(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', 5021, 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', 5023, 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden'),
 (6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', 68306, 'Germany')]

In [ ]:
%%sql
SELECT * FROM Products WHERE Price BETWEEN 10 AND 20 LIMIT 5;

 * sqlite:///customers.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18.0),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19.0),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10.0),
 (15, 'Genen Shouyu', 6, 2, '24 - 250 ml bottles', 15.5),
 (16, 'Pavlova', 7, 3, '32 - 500 g boxes', 17.45)]

In [ ]:
%%sql
SELECT * FROM Products WHERE Price BETWEEN 10 AND 20 LIMIT 5;

 * sqlite:///customers.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18.0),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19.0),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10.0),
 (15, 'Genen Shouyu', 6, 2, '24 - 250 ml bottles', 15.5),
 (16, 'Pavlova', 7, 3, '32 - 500 g boxes', 17.45)]

In [ ]:
%%sql
SELECT * FROM Products WHERE Price BETWEEN 10 AND 20 AND CategoryID NOT IN (1,2,3) LIMIT 5;

 * sqlite:///customers.db
Done.

[(31, 'Gorgonzola Telino', 14, 4, '12 - 100 g pkgs', 12.5),
 (36, 'Inlagd Sill', 17, 8, '24 - 250 g jars', 19.0),
 (40, 'Boston Crab Meat', 19, 8, '24 - 4 oz tins', 18.4),
 (42, 'Singaporean Hokkien Fried Mee', 20, 5, '32 - 1 kg pkgs.', 14.0),
 (46, 'Spegesild', 21, 8, '4 - 450 g glasses', 12.0)]

In [ ]:
%%sql
SELECT * FROM Products WHERE ProductName BETWEEN 'Carnarvon Tigers' AND 'Mozzarella di Giovanni' ORDER BY ProductName LIMIT 5;

 * sqlite:///customers.db
Done.

[(18, 'Carnarvon Tigers', 7, 8, '16 kg pkg.', 62.5),
 (1, 'Chais', 1, 1, '10 boxes x 20 bags', 18.0),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19.0),
 (39, 'Chartreuse verte', 18, 1, '750 cc per bottle', 18.0),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22.0)]

In [ ]:
%%sql
SELECT * FROM Products WHERE ProductName NOT BETWEEN 'Carnarvon Tigers' AND 'Mozzarella di Giovanni' ORDER BY ProductName LIMIT 5;

 * sqlite:///customers.db
Done.

[(17, 'Alice Mutton', 7, 6, '20 - 1 kg tins', 39.0),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10.0),
 (40, 'Boston Crab Meat', 19, 8, '24 - 4 oz tins', 18.4),
 (60, 'Camembert Pierrot', 28, 4, '15 - 300 g rounds', 34.0),
 (30, 'Nord-Ost Matjeshering', 13, 8, '10 - 200 g glasses', 25.89)]

In [ ]:
%%sql
SELECT * FROM Orders WHERE OrderDate BETWEEN '1996-07-01' AND '1996-07-31' LIMIT 5

 * sqlite:///customers.db
Done.

[(10248, 90, 5, '1996-07-04 00:00:00', 3),
 (10249, 81, 6, '1996-07-05 00:00:00', 1),
 (10250, 34, 4, '1996-07-08 00:00:00', 2),
 (10251, 84, 3, '1996-07-08 00:00:00', 1),
 (10252, 76, 4, '1996-07-09 00:00:00', 2)]

In [ ]:
%%sql
SELECT CustomerID AS ID, CustomerName AS Customer FROM Customers LIMIT 5

 * sqlite:///customers.db
Done.

[(2, 'Ana Trujillo Emparedados y helados'),
 (3, 'Antonio Moreno Taquería'),
 (4, 'Around the Horn'),
 (5, 'Berglunds snabbköp'),
 (6, 'Blauer See Delikatessen')]

In [ ]:
%%sql
SELECT Customers.CustomerID, Customers.CustomerName, Orders.OrderDate FROM Orders LEFT JOIN Customers ON Orders.CustomerID=Customers.CustomerID ORDER BY Customers.CustomerID ;

 * sqlite:///customers.db
Done.

[(2, 'Ana Trujillo Emparedados y helados', '1996-09-18 00:00:00'),
 (3, 'Antonio Moreno Taquería', '1996-11-27 00:00:00'),
 (4, 'Around the Horn', '1996-11-15 00:00:00'),
 (4, 'Around the Horn', '1996-12-16 00:00:00'),
 (5, 'Berglunds snabbköp', '1996-08-12 00:00:00'),
 (5, 'Berglunds snabbköp', '1996-08-14 00:00:00'),
 (5, 'Berglunds snabbköp', '1996-12-16 00:00:00'),
 (7, 'Blondel père et fils', '1996-07-25 00:00:00'),
 (7, 'Blondel père et fils', '1996-09-04 00:00:00'),
 (7, 'Blondel père et fils', '1996-11-22 00:00:00'),
 (7, 'Blondel père et fils', '1997-02-05 00:00:00'),
 (8, 'Bólido Comidas preparadas', '1996-10-10 00:00:00'),
 (9, "Bon app'", '1996-10-16 00:00:00'),
 (9, "Bon app'", '1996-10-29 00:00:00'),
 (9, "Bon app'", '1996-11-25 00:00:00'),
 (10, 'Bottom-Dollar Marketse', '1996-12-20 00:00:00'),
 (10, 'Bottom-Dollar Marketse', '1997-01-10 00:00:00'),
 (10, 'Bottom-Dollar Marketse', '1997-01-10 00:00:00'),
 (10, 'Bottom-Dollar Marketse', '1997-01-30 00:00:00'),
 (11, "B's Beverages", '1996-08-26 00:00:00'),
 (13, 'Centro comercial Moctezuma', '1996-07-18 00:00:00'),
 (14, 'Chop-suey Chinese', '1996-07-11 00:00:00'),
 (14, 'Chop-suey Chinese', '1996-12-03 00:00:00'),
 (15, 'Comércio Mineiro', '1996-08-27 00:00:00'),
 (16, 'Consolidated Holdings', '1997-02-04 00:00:00'),
 (17, 'Drachenblut Delikatessend', '1996-11-26 00:00:00'),
 (17, 'Drachenblut Delikatessend', '1996-12-23 00:00:00'),
 (18, 'Du monde entier', '1996-09-20 00:00:00'),
 (19, 'Eastern Connection', '1996-11-26 00:00:00'),
 (19, 'Eastern Connection', '1997-01-01 00:00:00'),
 (20, 'Ernst Handel', '1996-07-17 00:00:00'),
 (20, 'Ernst Handel', '1996-07-23 00:00:00'),
 (20, 'Ernst Handel', '1996-11-11 00:00:00'),
 (20, 'Ernst Handel', '1996-11-29 00:00:00'),
 (20, 'Ernst Handel', '1996-12-13 00:00:00'),
 (20, 'Ernst Handel', '1996-12-23 00:00:00'),
 (20, 'Ernst Handel', '1997-01-02 00:00:00'),
 (20, 'Ernst Handel', '1997-01-03 00:00:00'),
 (20, 'Ernst Handel', '1997-01-30 00:00:00'),
 (20, 'Ernst Handel', '1997-02-11 00:00:00'),
 (21, 'Familia Arquibaldo', '1996-11-06 00:00:00'),
 (21, 'Familia Arquibaldo', '1996-12-18 00:00:00'),
 (21, 'Familia Arquibaldo', '1997-01-14 00:00:00'),
 (23, 'Folies gourmandes', '1997-01-08 00:00:00'),
 (24, 'Folk och fä HB', '1996-07-24 00:00:00'),
 (24, 'Folk och fä HB', '1996-10-11 00:00:00'),
 (24, 'Folk och fä HB', '1996-12-10 00:00:00'),
 (24, 'Folk och fä HB', '1997-02-03 00:00:00'),
 (25, 'Frankenversand', '1996-07-29 00:00:00'),
 (25, 'Frankenversand', '1996-10-24 00:00:00'),
 (25, 'Frankenversand', '1996-10-30 00:00:00'),
 (25, 'Frankenversand', '1996-12-27 00:00:00'),
 (27, 'Franchi S.p.A.', '1997-01-22 00:00:00'),
 (28, 'Furia Bacalhau e Frutos do Mar', '1996-10-14 00:00:00'),
 (28, 'Furia Bacalhau e Frutos do Mar', '1996-11-12 00:00:00'),
 (29, 'Galería del gastrónomo', '1996-11-28 00:00:00'),
 (29, 'Galería del gastrónomo', '1997-01-27 00:00:00'),
 (30, 'Godos Cocina Típica', '1996-09-11 00:00:00'),
 (31, 'Gourmet Lanchonetes', '1997-01-23 00:00:00'),
 (33, 'GROSELLA-Restaurante', '1996-07-30 00:00:00'),
 (34, 'Hanari Carnes', '1996-07-08 00:00:00'),
 (34, 'Hanari Carnes', '1996-07-10 00:00:00'),
 (35, 'HILARIÓN-Abastos', '1996-07-16 00:00:00'),
 (35, 'HILARIÓN-Abastos', '1996-12-26 00:00:00'),
 (36, 'Hungry Coyote Import Store', '1996-12-06 00:00:00'),
 (36, 'Hungry Coyote Import Store', '1996-12-25 00:00:00'),
 (36, 'Hungry Coyote Import Store', '1997-01-15 00:00:00'),
 (37, 'Hungry Owl All-Night Grocers', '1996-09-05 00:00:00'),
 (37, 'Hungry Owl All-Night Grocers', '1996-09-19 00:00:00'),
 (37, 'Hungry Owl All-Night Grocers', '1996-10-22 00:00:00'),
 (37, 'Hungry Owl All-Night Grocers', '1996-12-05 00:00:00'),
 (37, 'Hungry Owl All-Night Grocers', '1996-12-12 00:00:00'),
 (37, 'Hungry Owl All-Night Grocers', '1997-01-29 00:00:00'),
 (38, 'Island Trading', '1996-09-26 00:00:00'),
 (38, 'Island Trading', '1996-10-01 00:00:00'),
 (38, 'Island Trading', '1996-10-03 00:00:00'),
 (39, 'Königlich Essen', '1996-10-07 00:00:00'),
 (39, 'Königlich Essen', '1996-10-09 00:00:00'),
 (41, "La maison d'Asie", '1996-11-11 00:00:00'),
 (41, "La maison d'Asie", '1996-11-20 00:00:00'),
 (41, "La maison d'Asie", '1996-12-03 00:00:00'),
 (41, "La maison d'Asie", '1997-01-14 00:00:00'),
 (41, "La maison d'Asie", '1997-01-24 00:00:00'),
 (44, 'Lehmanns Marktstand', '1996-08-13 00:00:00'),
 (44, 'Lehmanns Marktstand', '1996-08-19 00:00:00'),
 (44, 'Lehmanns Marktstand', '1996-10-31 00:00:00'),
 (46, 'LILA-Supermercado', '1996-08-16 00:00:00'),
 (46, 'LILA-Supermercado', '1996-09-03 00:00:00'),
 (46, 'LILA-Supermercado', '1996-10-16 00:00:00'),
 (46, 'LILA-Supermercado', '1996-11-19 00:00:00'),
 (46, 'LILA-Supermercado', '1996-12-12 00:00:00'),
 (47, 'LINO-Delicateses', '1997-01-06 00:00:00'),
 (48, 'Lonesome Pine Restaurant', '1996-09-17 00:00:00'),
 (48, 'Lonesome Pine Restaurant', '1996-09-30 00:00:00'),
 (49, 'Magazzini Alimentari Riuniti', '1996-08-07 00:00:00'),
 (49, 'Magazzini Alimentari Riuniti', '1996-09-09 00:00:00'),
 (49, 'Magazzini Alimentari Riuniti', '1997-01-03 00:00:00'),
 (51, 'Mère Paillarde', '1996-10-17 00:00:00'),
 (51, 'Mère Paillarde', '1996-10-28 00:00:00'),
 (51, 'Mère Paillarde', '1996-12-09 00:00:00'),
 (51, 'Mère Paillarde', '1997-01-23 00:00:00'),
 (51, 'Mère Paillarde', '1997-02-07 00:00:00'),
 (52, 'Morgenstern Gesundkost', '1996-08-09 00:00:00'),
 (54, 'Océano Atlántico Ltda.', '1997-01-09 00:00:00'),
 (55, 'Old World Delicatessen', '1996-07-19 00:00:00'),
 (55, 'Old World Delicatessen', '1996-09-13 00:00:00'),
 (55, 'Old World Delicatessen', '1996-10-25 00:00:00'),
 (55, 'Old World Delicatessen', '1997-02-10 00:00:00'),
 (56, 'Ottilies Käseladen', '1997-01-07 00:00:00'),
 (58, 'Pericles Comidas clásicas', '1996-10-04 00:00:00'),
 (58, 'Pericles Comidas clásicas', '1996-11-14 00:00:00'),
 (59, 'Piccolo und mehr', '1996-11-13 00:00:00'),
 (59, 'Piccolo und mehr', '1996-12-24 00:00:00'),
 (59, 'Piccolo und mehr', '1997-01-27 00:00:00'),
 (60, 'Princesa Isabel Vinhoss', '1996-10-23 00:00:00'),
 (60, 'Princesa Isabel Vinhoss', '1996-12-27 00:00:00'),
 (60, 'Princesa Isabel Vinhoss', '1997-02-03 00:00:00'),
 (61, 'Que Delícia', '1996-07-19 00:00:00'),
 (61, 'Que Delícia', '1996-08-27 00:00:00'),
 (61, 'Que Delícia', '1996-12-11 00:00:00'),
 (61, 'Que Delícia', '1997-01-21 00:00:00'),
 (62, 'Queen Cozinha', '1996-12-04 00:00:00'),
 (62, 'Queen Cozinha', '1997-01-07 00:00:00'),
 (63, 'QUICK-Stop', '1996-08-05 00:00:00'),
 (63, 'QUICK-Stop', '1996-08-20 00:00:00'),
 (63, 'QUICK-Stop', '1996-08-21 00:00:00'),
 (63, 'QUICK-Stop', '1996-09-24 00:00:00'),
 (63, 'QUICK-Stop', '1996-11-04 00:00:00'),
 (63, 'QUICK-Stop', '1996-11-22 00:00:00'),
 (63, 'QUICK-Stop', '1997-01-17 00:00:00'),
 (65, 'Rattlesnake Canyon Grocery', '1996-07-22 00:00:00'),
 (65, 'Rattlesnake Canyon Grocery', '1996-08-02 00:00:00'),
 (65, 'Rattlesnake Canyon Grocery', '1996-08-30 00:00:00'),
 (65, 'Rattlesnake Canyon Grocery', '1996-09-25 00:00:00'),
 (65, 'Rattlesnake Canyon Grocery', '1996-09-27 00:00:00'),
 (65, 'Rattlesnake Canyon Grocery', '1996-11-05 00:00:00'),
 (65, 'Rattlesnake Canyon Grocery', '1997-01-01 00:00:00'),
 (66, 'Reggiani Caseifici', '1996-08-23 00:00:00'),
 (66, 'Reggiani Caseifici', '1997-01-28 00:00:00'),
 (66, 'Reggiani Caseifici', '1997-02-12 00:00:00'),
 (67, 'Ricardo Adocicados', '1996-08-22 00:00:00'),
 (67, 'Ricardo Adocicados', '1996-09-06 00:00:00'),
 (68, 'Richter Supermarkt', '1996-07-12 00:00:00'),
 (68, 'Richter Supermarkt', '1997-01-20 00:00:00'),
 (69, 'Romero y tomillo', '1996-08-14 00:00:00'),
 (69, 'Romero y tomillo', '1996-08-15 00:00:00'),
 (69, 'Romero y tomillo', '1996-09-16 00:00:00'),
 (70, 'Santé Gourmet', '1996-12-18 00:00:00'),
 (71, 'Save-a-lot Markets', '1996-10-08 00:00:00'),
 (71, 'Save-a-lot Markets', '1996-12-25 00:00:00'),
 (71, 'Save-a-lot Markets', '1996-12-30 00:00:00'),
 (71, 'Save-a-lot Markets', '1997-02-10 00:00:00'),
 (72, 'Seven Seas Imports', '1996-11-21 00:00:00'),
 (72, 'Seven Seas Imports', '1996-12-09 00:00:00'),
 (72, 'Seven Seas Imports', '1996-12-19 00:00:00'),
 (73, 'Simons bistro', '1996-10-29 00:00:00'),
 (73, 'Simons bistro', '1997-01-16 00:00:00'),
 (75, 'Split Rail Beer & Ale', '1996-08-01 00:00:00'),
 (75, 'Split Rail Beer & Ale', '1996-10-15 00:00:00'),
 (75, 'Split Rail Beer & Ale', '1996-11-08 00:00:00'),
 (75, 'Split Rail Beer & Ale', '1996-12-02 00:00:00'),
 (75, 'Split Rail Beer & Ale', '1996-12-17 00:00:00'),
 (75, 'Split Rail Beer & Ale', '1997-01-31 00:00:00'),
 (76, 'Suprêmes délices', '1996-07-09 00:00:00'),
 (76, 'Suprêmes délices', '1996-09-10 00:00:00'),
 (77, 'The Big Cheese', '1996-09-20 00:00:00'),
 (79, 'Toms Spezialitäten', '1997-02-06 00:00:00'),
 (80, 'Tortuga Restaurante', '1996-08-08 00:00:00'),
 (80, 'Tortuga Restaurante', '1996-08-29 00:00:00'),
 (80, 'Tortuga Restaurante', '1996-09-12 00:00:00'),
 (80, 'Tortuga Restaurante', '1996-10-02 00:00:00'),
 (81, 'Tradição Hipermercados', '1996-07-05 00:00:00'),
 (81, 'Tradição Hipermercados', '1996-08-28 00:00:00'),
 (83, 'Vaffeljernet', '1996-11-28 00:00:00'),
 (83, 'Vaffeljernet', '1996-12-31 00:00:00'),
 (84, 'Victuailles en stock', '1996-07-08 00:00:00'),
 (84, 'Victuailles en stock', '1996-10-21 00:00:00'),
 (85, 'Vins et alcools Chevalier', '1996-08-06 00:00:00'),
 (85, 'Vins et alcools Chevalier', '1996-09-02 00:00:00'),
 (86, 'Die Wandernde Kuh', '1996-09-09 00:00:00'),
 (86, 'Die Wandernde Kuh', '1996-09-23 00:00:00'),
 (86, 'Die Wandernde Kuh', '1996-11-07 00:00:00'),
 (86, 'Die Wandernde Kuh', '1996-11-18 00:00:00'),
 (87, 'Wartian Herkku', '1996-07-26 00:00:00'),
 (87, 'Wartian Herkku', '1996-08-01 00:00:00'),
 (87, 'Wartian Herkku', '1996-10-03 00:00:00'),
 (87, 'Wartian Herkku', '1996-10-18 00:00:00'),
 (87, 'Wartian Herkku', '1997-01-13 00:00:00'),
 (87, 'Wartian Herkku', '1997-01-16 00:00:00'),
 (87, 'Wartian Herkku', '1997-02-05 00:00:00'),
 (88, 'Wellington Importadora', '1996-07-15 00:00:00'),
 (88, 'Wellington Importadora', '1997-01-21 00:00:00'),
 (89, 'White Clover Markets', '1996-07-31 00:00:00'),
 (89, 'White Clover Markets', '1996-11-01 00:00:00'),
 (90, 'Wilman Kala', '1996-07-04 00:00:00'),
 (91, 'Wolski', '1996-12-05 00:00:00')]